<template>
	<view class="agreement-index">
		<bar ref="bar"></bar>
		<view @tap="btnBack()" class="safe-header">
			<image src="../../../static/image/login/left.svg" />
			<text>Hupool矿机租赁服务协议</text>
		</view>
		<scroll-view class="uni-content" scroll-y="true" :style="{ height: scrollHeight + 'px' }">
			<view class="agreement-content">
				<view class="content">《Hupool矿机租赁服务协议》（“本协议”）是Hupool云矿机平台（“Hupool”或“我们”或“公司”）和使用Hupool提供的服务的用户（“用户”或“您”）之间的协议。本协议描述了Hupool和用户的相关权利和责任。您使用Hupool提供的服务，即表示您同意本协议规定的全部条款。。</view>
				<view class="title">一、矿机租赁套餐及费用</view>
				<view class="content">1.1
					矿机租赁套餐包含矿机租赁期的算力费、电费、服务费等。其中算力费是指根据矿机市场行情结合租赁期限的长短来综合计算的租赁费用，该费用随着市场行情的变化而变化，不同时间的订单费用存在差异；电费是指租赁期内根据矿机实际功耗需要预缴的电力使用费，该费用以订单生成时的为准，若因国家政策等原因导致电费价格调整的，已支付的费用不受影响，未支付的费用有可能受政策影响而调整；服务费用是指Hupool平台或数据中心对委托管理的矿机设备维护的相关费用，包含矿机上下架、矿场矿机运维、矿机维修、电力线损等费用，该费用从用户每日收益中扣除。

					1.2 费用支付的金额以Hupool.com网站订单生成时的金额为准。因数字资产行情波动较大，导致矿机市场行情波动较大，请您仔细确认。

					1.3
					费用支付的途径和收款方式以Hupool.com网站订单页面提供的方式为准。其中矿机租赁费用为一次性支付全部费用，电费为按天预付费用。用户支付完成订单页面显示的全部金额后，订单方生效。（您对支付的准确性负全部责任，包括但不限于：目的地址账户（数字资产钱包地址）错误，金额错误及其他付款细节，因此产生的损失由用户自行承担）。若您未按期缴纳电费，订单将被冻结，冻结期限超过5天的，合同终止，已支付费用不予退还。

					1.4 收益分配：

					1.4.1
					您租赁的算力正式上线后，我们将按照您订单生成时的算力值，并以矿池实际结算的数字资产收益，以T+1的方式发放在您注册账户的挖矿账户余额中。当您的数字资产达到提取的最低限额时，您可申请提现。我们将在规定的时间内支付至您提供的数字资产钱包地址。

					1.4.2 您理解并同意：由于全网算力会变化，挖矿难度会随之变化，挖矿收益也是变化的。

					1.4.3 您理解并同意：由于不同批次矿机接入的矿池不同，您的实际收益数据根据矿池的不同存在小额的差异。因矿池技术故障或者其他不稳定因素，平台拥有切换矿池的权利，当订单切换矿池后，将以新接入矿池的收益为准。

					1.5 费用变动：服务费、电费根据市场行情（如：丰水期、枯水期、国家政策等电费上涨或下降，管理建设成本增加与减少等因素），乙方有权进行市场价格调整，甲方有知情权，具体价格以乙方通告为准。</view>
				<view class="title">二、风险通知</view>
				<view class="content">2.1
					您理解并认可：持有，交易，投资数字货币以及使用数字货币相关的服务会涉及风险，本第2.1条列出的风险并非穷尽。这些风险以及现在或将来出现的其他风险可能会使得您无法获得任何收益，遭受财务损失，甚至使得我们提供的服务被终止：

					（1）使用任何数字货币或相关的产品和服务都会带来潜在的财务，监管和其他风险。您在使用任何数字货币或相关的产品和服务前应确认您对区块链技术，数字货币以及智能合约的功能和风险方面具有充分的知识和经验。您参与任何数字货币活动和/或使用相关服务的任何决定应基于您认为必要的独立调查和/或获取专业人士的咨询。Hupool默认您在使用本服务时是一名了解数字货币行业并且懂得数字货币相关产品和服务风险的专业人士，本协议以及Hupool提供的任何服务均不应视为Hupool向您提供投资建议；

					（2）任何Hupool提供的矿机租赁服务套餐的价值以及任何数量的任何数字货币都可能因不受Hupool控制的许多因素而受影响，这些因素包括但不限于：挖矿难度和/或其他挖矿参数/属性的变化，数字货币的市场价格波动，硬件（例如：挖矿设备）过时和硬件摊销等；

					（3）由于数字货币的性质，任何数字货币的价值可能随时损失其部分甚至全部价值。您在此确认知悉任何一种数字货币的价值都可能会迅速下降（甚至下降为零）。对于任何数字货币的市场价格波动所造成的任何和所有损失，Hupool不承担任何责任；

					（4）Hupool会不时对于系统进行维护或升级。您确认您并未期待Hupool提供的服务是连续的，不中断的。除双方另有明确约定，否则Hupool对于其系统的维护和升级而导致的暂停和中断所造成的任何和所有损失，Hupool不承担责任；

					（5）没有一种身份验证，或计算机安全技术是100%安全的。您同意承担黑客入侵或身份盗用相关的所有风险； </view>
				<view class="title">三、违约责任 </view>
				<view class="content">3.1、双方应严格按照本合同约定履行各方的权利义务。若违反本合同约定的，违约方应向守约方赔偿由此给守约方造成的全部损失。

					3.2、如因自然灾害（洪水、泥石流、地震、飓风等）、政策影响（国家发布文件等）、战争、政治动荡等不可抗力造成的停电、矿场及矿机损坏，公司不承担任何责任。发生不可抗力超过7日仍未能解决的，本合同自动终止，双方互不追究责任，您已支付的费用不可退还，未支付费用无须继续支付。</view>
				<view class="title">四、其他约定</view>
				<view class="content">4.1 Hupool将不定期更新合同文本内容，请您务必仔细阅读，当合同内容更新后，新订单将按照新的合同内容执行。

					4.2 弃权：公司对本协议项下用户的任何违约行为延迟行使或者疏于行使公司的任何权利或救济，不应解释为公司豁免或者默许任何该等违约行为。

					4.3 可分割性：若本协议的任何条款被认定不合法或者不可执行，则该认定应不影响本协议的其余条款。

					4.4 适用法律：本协议适用于中华人民共和国法律。

					4.5 争议解决：如果各方在本协议履行过程中发生任何争议, 如协商不成，任何一方有权提交由深圳国际仲裁院提请仲裁。仲裁裁决是终局的，对双方均具有约束力。</view>


			</view>
		</scroll-view>
	</view>
</template>

<script>
	import Bar from '@/components/uni-status-bar/uni-status-bar.vue';
	export default {
		components: {
			Bar
		},
		data() {
			return {
				scrollHeight: 0,
			}
		},
		onLoad() {

		},
		methods: {
			btnBack: function() {
				this.util.UiUtils.switchBackPage2();
			},
		},
		onShow() {
			let _this = this;
			//获取高度
			uni.getSystemInfo({
				success(res) {
					_this.scrollHeight = res.windowHeight - res.statusBarHeight - 44;
				}
			});
		}
	}
</script>

<style lang="scss">
	@import "../../register/agreement/agreement.scss"
</style>
